In [2]:
import numpy as np
import pandas as pd

## missing variables

In [3]:
sozlukVerisi = {"Istanbul": [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
havaDurumuDataFrame.dropna()  #nanları düşürmek ama tüm satırları çıkardı

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [7]:
yeniVeri = {"Istanbul": [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame= pd.DataFrame(yeniVeri)

In [8]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [9]:
yeniDataFrame.dropna(axis =1, thresh = 2)  ## thresh limit 2 ve üstünü atacak

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [10]:
yeniDataFrame.fillna("dolduruldu")

     Istanbul      Ankara  Izmir     Antalya
0        30.0        20.0     40        45.0
1        29.0  dolduruldu     39  dolduruldu
2  dolduruldu        25.0     38  dolduruldu

## gruplandırmak groupby

In [11]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan Ismi": ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"], "Maas": [100,150,200,300,400,500]}

In [12]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [13]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [15]:
maasDataFrame.groupby("Departman")

In [16]:
grupObjesi = maasDataFrame.groupby("Departman")

In [21]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [17]:
grupObjesi.count()  ##o grupta kaç kişi olduğu

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [18]:
grupObjesi.mean() ## ortalama

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [19]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [20]:
grupObjesi.describe()  # sayım, ortalama, standar sapma , min , max

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0